package java1212;

public class Recursive_method {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

/*
// 재귀 메소드 
 보통 메소드는 어떤 작업을 수행하기 위해 다른 메소드를 호출한다.
 그러나 메소드가 자기 자신을 호출할 수 있다.
 이런 메소드는 재귀 메소드(recursive method)라고 부른다.
 재귀(recursive)는 한 메소드가 어떤 작업을 수행하기 위해 자기 자신을 호출하는 프로그래밍 기법이다.
 
 // 예시
 생일날 큰 선물 상자를 받았다고 가정.
 선물 상자를 열어보니 그 안에 테니스 라켓과 또 다른 상자가 있다.
 두번째 상자를 열어보니 그 안에 테니스 운동화와 또 다른 상자가 있다.
 세번째 상자를 열어보니 테니스 공이 들어있다.
 
정의
선물 상자는 선물이다.
혹은 선물 상자는 선물과 선물 상자이다.

숫자 목록은 숫자이다.
혹은 숫자 목록은 숫자, 쉼표(,)와 숫자 목록이다.


*/		
		
		
		
		
	}

}
